---
kind: property
id: P:Autodesk.Revit.DB.Analysis.SpatialFieldManager.LegendPosition
source: html/a82d13f2-e0d6-b3d5-1aa4-3985f68a51fe.htm
---
# Autodesk.Revit.DB.Analysis.SpatialFieldManager.LegendPosition Property

Stores current position of analysis results legend element in view

## Syntax (C#)
```csharp
public XYZ LegendPosition { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null